<script lang="ts" setup>
import { ref, onMounted, onUnmounted } from 'vue'
const { t } = useI18n()
const router = useRouter()
const scrollTop = ref(0)
const section1 = ref<HTMLElement | null>(null)
const section2 = ref<HTMLElement | null>(null)
const section3 = ref<HTMLElement | null>(null)
const section4 = ref<HTMLElement | null>(null)
const windowHeight = ref(0)
onMounted(() => {
  document.documentElement.scrollTop = 0
  if (window) {
    console.log('window', window.innerWidth)
    window.addEventListener('scroll', handleScroll)
  }
  windowHeight.value = window.innerHeight
  window.addEventListener('resize', () => {
    windowHeight.value = window.innerHeight
  })
})
const handleScroll = () => {
  scrollTop.value = window.scrollY
  let scrollTrue = scrollTop.value + windowHeight.value
  console.log('offsetTop', section1.value?.offsetTop)
  console.log('scrollTop', window.scrollY)
  console.log('scrollTrue', scrollTrue)

  console.log(scrollTrue >= section1.value?.offsetTop - 100)
  if (scrollTrue >= section3.value?.offsetTop - 100) {
    section3.value?.classList.add('section-attain')
  } else {
    section3.value?.classList.remove('section-attain')
  }
  if (scrollTrue >= section4.value?.offsetTop - 100) {
    section4.value?.classList.add('section-scale')
  } else {
    section4.value?.classList.remove('section-scale')
  }
}
onUnmounted(() => {
  if (window) {
    window.removeEventListener('scroll', handleScroll)
  }
})
</script>

<template>
  <div class="cont">
    <headerTop opaque></headerTop>
    <div class="index-bg">
      <div class="index-bg-content">
        <div class="content">
          <h3>我們的服務</h3>
          <div class="nav">
            <a @click="navigateTo('/')">首頁</a>
            <svg
              t="1746194722406"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="10488"
              width="20"
              height="20"
            >
              <path
                d="M207.55456 924.22656l446.11072-407.53664-446.11072-407.54176a39.6032 39.6032 0 0 1 0-56.23296c15.54432-15.55968 40.832-15.55968 56.38144 0l474.80832 433.61792c8.28928 8.2944 11.84256 19.31264 11.30496 30.1568 0.5376 10.83392-3.01568 21.83168-11.30496 30.15168L263.936 980.45952c-15.54944 15.55968-40.83712 15.55968-56.38144 0a39.6032 39.6032 0 0 1 0-56.23296z"
                fill=""
                p-id="10489"
              ></path>
            </svg>
            <span>我們的服務</span>
          </div>
        </div>
      </div>
    </div>
    <section class="section3">
      <div class="section4-content">
        <div class="section4-content-title">
          <h2>{{ '我們的核心' }}</h2>
          <p>
            我們的核心 专注于科技/传媒、医疗健康、消费品
            现代服务、工业科技四个方向的投资机遇。
          </p>
        </div>
        <div class="section4-content-items">
          <div class="item">
            <svg
              t="1746255913391"
              class="icon"
              viewBox="0 0 1152 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="5826"
            >
              <path
                d="M283.904 743.68l290.368 156.672 290.432-156.736a54.464 54.464 0 0 1 73.664 21.824c14.336 26.304 4.48 59.2-21.888 73.408l-342.208 184.64-342.208-184.64a54.016 54.016 0 0 1-21.888-73.408 54.464 54.464 0 0 1 73.728-21.76z m299.648-632.32a18.176 18.176 0 0 0-18.56 0L147.2 358.144 565.12 604.8c5.632 3.392 12.736 3.392 18.432 0l417.92-246.656-417.92-246.656z m558.272 217.408a53.76 53.76 0 0 1 8.704 29.312v324.864c0 29.952-24.32 54.144-54.4 54.144a54.272 54.272 0 0 1-54.336-54.144V460.16l-402.816 237.824a127.296 127.296 0 0 1-129.344 0L33.856 417.088a68.48 68.48 0 0 1 0-118.016L509.632 18.24a127.296 127.296 0 0 1 129.28 0l475.776 280.832c12.288 7.232 21.504 17.728 27.136 29.696z"
                p-id="5827"
              ></path>
            </svg>
            <h3>成就基業</h3>
            <p>
              红杉资本始终致力于帮助创业者成就基业长青的伟大公司，为企业带来丰富的全球资源和宝贵的历史经验。
            </p>
          </div>
          <div class="item">
            <svg
              t="1746255937500"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="5977"
            >
              <path
                d="M786.358857 809.325714a88.356571 88.356571 0 0 1 176.566857 0 88.283429 88.283429 0 0 1-176.566857 0z m-274.797714 89.234286c-48.64 0-88.210286-39.497143-88.210286-88.064a88.210286 88.210286 0 0 1 176.420572 0c0 48.566857-39.570286 88.064-88.210286 88.064zM512.512 59.538286c48.566857 0 88.137143 39.497143 88.137143 87.917714a88.137143 88.137143 0 0 1-176.201143 0c0-48.493714 39.497143-87.917714 88.064-87.917714zM145.334857 896.731429c-48.64 0-88.210286-39.497143-88.210286-88.137143a88.283429 88.283429 0 0 1 176.493715 0c0 48.64-39.643429 88.137143-88.283429 88.137143zM905.069714 425.691429a29.549714 29.549714 0 0 0-8.265143-20.48 30.793143 30.793143 0 0 0-20.48-8.265143H541.257143V291.181714a147.309714 147.309714 0 0 0 117.906286-144.237714 147.163429 147.163429 0 0 0-294.253715 0c0 71.826286 49.883429 131.510857 118.125715 144.237714-0.146286 0.365714-1.974857 105.691429-1.974858 105.691429H147.675429a28.452571 28.452571 0 0 0-20.48 8.265143 30.134857 30.134857 0 0 0-8.923429 20.48l0.658286 241.590857c-59.245714 9.508571-118.345143 70.656-118.345143 143.725714 0 81.042286 65.974857 147.017143 147.090286 147.017143 81.188571 0 147.163429-65.974857 147.163428-147.017143 0-70.656-53.101714-131.437714-112.128-143.725714V464.969143h300.324572v191.488c0 3.730286 0.877714 7.094857 2.048 10.24a147.017143 147.017143 0 0 0-120.173715 144.237714 147.236571 147.236571 0 0 0 294.253715 0c0-71.899429-52.077714-131.657143-120.539429-144.237714a29.110857 29.110857 0 0 0 1.974857-10.24V464.969143h300.617143v202.24c-64.365714 14.116571-112.054857 73.142857-112.054857 143.725714a147.236571 147.236571 0 0 0 294.253714 0c0-72.996571-57.344-134.656-118.345143-144.530286 0.365714-1.097143 0-240.786286 0-240.786285z"
                p-id="5978"
              ></path>
            </svg>
            <h3>創業者背後的</h3>
            <p>
              專注於科技/媒體、醫療健康、消費品/現代服務、工業科技四個方向的投資機會。
            </p>
          </div>
          <div class="item">
            <svg
              t="1746255956132"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="6287"
            >
              <path
                d="M816.57788 283.525402l0-94.499258c0-17.248849-13.985526-31.233352-31.233352-31.233352-17.248849 0-31.233352 13.985526-31.233352 31.233352l0 94.499258c0 92.384084-56.728002 176.528506-144.526651 214.370369-11.452843 4.931313-18.87079 16.2061-18.87079 28.681226s7.416923 23.750937 18.87079 28.681226c87.798649 37.841863 144.526651 121.986285 144.526651 214.365252l0 74.179466c0 17.253966 13.985526 31.233352 31.233352 31.233352 17.248849 0 31.233352-13.979386 31.233352-31.233352l0-74.179466c0-97.707322-49.605791-188.012048-130.124639-243.047502C766.972089 471.542566 816.57788 381.237841 816.57788 283.525402z"
                p-id="6288"
              ></path>
              <path
                d="M414.093133 497.896794c-87.798649-37.841863-144.526651-121.986285-144.526651-214.370369l0-94.499258c0-17.248849-13.985526-31.233352-31.233352-31.233352-17.248849 0-31.233352 13.985526-31.233352 31.233352l0 94.499258c0 97.712439 49.605791 188.017164 130.124639 243.052618-80.518848 55.035454-130.124639 145.340179-130.124639 243.047502l0 74.179466c0 17.253966 13.984503 31.233352 31.233352 31.233352 17.248849 0 31.233352-13.979386 31.233352-31.233352l0-74.179466c0-92.378967 56.728002-176.523389 144.526651-214.365252 11.453866-4.931313 18.87079-16.2061 18.87079-28.681226S425.546999 502.827083 414.093133 497.896794z"
                p-id="6289"
              ></path>
              <path
                d="M137.035026 127.10384l749.607606 0c17.248849 0 31.233352-13.984503 31.233352-31.233352s-13.985526-31.233352-31.233352-31.233352L137.035026 64.637136c-17.248849 0-31.233352 13.984503-31.233352 31.233352S119.786177 127.10384 137.035026 127.10384z"
                p-id="6290"
              ></path>
              <path
                d="M886.642632 897.538797 137.035026 897.538797c-17.248849 0-31.233352 13.979386-31.233352 31.233352s13.984503 31.233352 31.233352 31.233352l749.607606 0c17.248849 0 31.233352-13.979386 31.233352-31.233352S903.890458 897.538797 886.642632 897.538797z"
                p-id="6291"
              ></path>
              <path
                d="M389.951293 217.418798c-17.248849 0-31.233352 13.985526-31.233352 31.233352l0 30.470989c0 17.248849 13.985526 31.233352 31.233352 31.233352 17.248849 0 31.233352-13.984503 31.233352-31.233352l0-30.470989C421.184645 231.403301 407.200142 217.418798 389.951293 217.418798z"
                p-id="6292"
              ></path>
              <path
                d="M633.725342 217.418798c-17.248849 0-31.233352 13.985526-31.233352 31.233352l0 30.470989c0 17.248849 13.984503 31.233352 31.233352 31.233352s31.233352-13.984503 31.233352-31.233352l0-30.470989C664.958694 231.403301 650.974191 217.418798 633.725342 217.418798z"
                p-id="6293"
              ></path>
              <path
                d="M588.866668 358.879624c-14.270005-9.414417-33.567513-5.409197-43.159986 8.754385-0.132006 0.193405-13.614066 19.754926-34.177404 19.754926-19.993357 0-32.428573-18.107403-33.271778-19.368116-9.165754-14.437827-28.285207-18.819624-42.829458-9.760295-14.655791 9.099239-19.155269 28.356838-10.04989 43.007513 11.209296 18.047028 41.974997 48.588625 86.152149 48.588625 43.963281 0 75.105558-30.308283 86.578868-48.223305C607.325066 387.236462 603.145883 368.274598 588.866668 358.879624z"
                p-id="6294"
              ></path>
              <path
                d="M349.978906 799.85194c6.272867 0 12.602016-1.880837 18.09717-5.794983 0.558725-0.397043 57.007365-39.905872 142.93541-39.905872 84.692914 0 143.810337 39.35738 144.989185 40.160675 14.152325 9.729595 33.562397 6.222725 43.383066-7.910157 9.831926-14.172791 6.318916-33.633005-7.853875-43.475164-3.01466-2.094708-75.049277-51.243081-180.518377-51.243081-105.682971 0-176.227654 49.39192-179.181939 51.496861-14.051017 10.004865-17.324574 29.515221-7.315616 43.556005C330.61079 795.297204 340.223728 799.85194 349.978906 799.85194z"
                p-id="6295"
              ></path>
            </svg>
            <h3>業務分析</h3>
            <p>
              紅杉資本中國基金投資了近600家具備創新商業模式,高成長性和高發展潛力的企業。
            </p>
          </div>
          <div class="item">
            <svg
              t="1746255971722"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="6597"
            >
              <path
                d="M786.358857 809.325714a88.356571 88.356571 0 0 1 176.566857 0 88.283429 88.283429 0 0 1-176.566857 0z m-274.797714 89.234286c-48.64 0-88.210286-39.497143-88.210286-88.064a88.210286 88.210286 0 0 1 176.420572 0c0 48.566857-39.570286 88.064-88.210286 88.064zM512.512 59.538286c48.566857 0 88.137143 39.497143 88.137143 87.917714a88.137143 88.137143 0 0 1-176.201143 0c0-48.493714 39.497143-87.917714 88.064-87.917714zM145.334857 896.731429c-48.64 0-88.210286-39.497143-88.210286-88.137143a88.283429 88.283429 0 0 1 176.493715 0c0 48.64-39.643429 88.137143-88.283429 88.137143zM905.069714 425.691429a29.549714 29.549714 0 0 0-8.265143-20.48 30.793143 30.793143 0 0 0-20.48-8.265143H541.257143V291.181714a147.309714 147.309714 0 0 0 117.906286-144.237714 147.163429 147.163429 0 0 0-294.253715 0c0 71.826286 49.883429 131.510857 118.125715 144.237714-0.146286 0.365714-1.974857 105.691429-1.974858 105.691429H147.675429a28.452571 28.452571 0 0 0-20.48 8.265143 30.134857 30.134857 0 0 0-8.923429 20.48l0.658286 241.590857c-59.245714 9.508571-118.345143 70.656-118.345143 143.725714 0 81.042286 65.974857 147.017143 147.090286 147.017143 81.188571 0 147.163429-65.974857 147.163428-147.017143 0-70.656-53.101714-131.437714-112.128-143.725714V464.969143h300.324572v191.488c0 3.730286 0.877714 7.094857 2.048 10.24a147.017143 147.017143 0 0 0-120.173715 144.237714 147.236571 147.236571 0 0 0 294.253715 0c0-71.899429-52.077714-131.657143-120.539429-144.237714a29.110857 29.110857 0 0 0 1.974857-10.24V464.969143h300.617143v202.24c-64.365714 14.116571-112.054857 73.142857-112.054857 143.725714a147.236571 147.236571 0 0 0 294.253714 0c0-72.996571-57.344-134.656-118.345143-144.530286 0.365714-1.097143 0-240.786286 0-240.786285z"
                p-id="6598"
              ></path>
            </svg>
            <h3>社群媒體行銷</h3>
            <p>
              2006年紅杉資本收購了印度創投公司Westbridge Capital
              Partners，改名為紅杉資本印度公司。
            </p>
          </div>
          <div class="item">
            <svg
              t="1746256255123"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="13920"
              width="200"
              height="200"
            >
              <path
                d="M977.454545 81.454545v236.125091a34.909091 34.909091 0 0 1-69.818181 0V165.701818l-269.870546 269.870546a34.816 34.816 0 0 1-49.338182 0 34.909091 34.909091 0 0 1 0-49.384728L858.251636 116.363636h-151.831272a34.909091 34.909091 0 1 1 0.046545-69.818181h236.078546a34.909091 34.909091 0 0 1 34.90909 34.90909zM386.280727 588.381091L116.363636 858.251636v-151.924363a34.909091 34.909091 0 1 0-69.818181 0.046545v236.171637a34.909091 34.909091 0 0 0 34.90909 34.90909h236.171637a34.909091 34.909091 0 0 0 0-69.818181H165.748364l269.917091-269.917091a34.909091 34.909091 0 1 0-49.384728-49.338182zM165.748364 116.363636h151.924363A34.909091 34.909091 0 1 0 317.626182 46.545455H81.454545a34.909091 34.909091 0 0 0-34.90909 34.90909v236.125091a34.909091 34.909091 0 0 0 69.818181 0V165.701818l269.917091 269.870546a34.816 34.816 0 0 0 49.338182 0 34.909091 34.909091 0 0 0 0-49.384728L165.748364 116.363636zM942.545455 671.464727a34.909091 34.909091 0 0 0-34.909091 34.909091v151.924364l-269.870546-269.917091a34.909091 34.909091 0 1 0-49.384727 49.384727l269.870545 269.917091h-151.831272A34.909091 34.909091 0 1 0 706.466909 977.454545h236.078546a34.909091 34.909091 0 0 0 34.90909-34.90909v-236.171637a34.909091 34.909091 0 0 0-34.90909-34.909091z"
                p-id="13921"
              ></path>
            </svg>
            <h3>實踐行動</h3>
            <p>
              专注于科技/传媒、医疗健康、消费品/服务、新能源/清洁技术/先进制造四个方向的投资机遇。
            </p>
          </div>
          <div class="item">
            <svg
              t="1746256109072"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="7207"
            >
              <path
                d="M473.301333 267.861333a42.666667 42.666667 0 0 1-10.453333 59.392l-164.394667 115.072v416a42.666667 42.666667 0 1 1-85.333333 0V420.096a42.666667 42.666667 0 0 1 18.218667-34.986667L413.866667 257.365333a42.666667 42.666667 0 0 1 59.392 10.496z"
                p-id="7208"
              ></path>
              <path
                d="M418.688 90.154667a42.666667 42.666667 0 0 1 44.16 2.901333l182.570667 127.786667a42.666667 42.666667 0 0 1 18.176 34.986666v215.338667l109.952 78.506667a42.666667 42.666667 0 0 1 17.877333 34.773333v273.834667a42.666667 42.666667 0 0 1-42.666667 42.666666h-310.4a42.666667 42.666667 0 0 1-42.666666-42.666666V128a42.666667 42.666667 0 0 1 22.997333-37.845333z m62.336 119.808v605.653333h225.066667v-209.237333l-109.952-78.506667a42.666667 42.666667 0 0 1-17.877334-34.730667V278.016l-97.237333-68.053333z"
                p-id="7209"
              ></path>
              <path
                d="M85.333333 858.282667a42.666667 42.666667 0 0 1 42.666667-42.666667h730.282667a42.666667 42.666667 0 1 1 0 85.333333H128a42.666667 42.666667 0 0 1-42.666667-42.666666z"
                p-id="7210"
              ></path>
            </svg>
            <h3>至今進展</h3>
            <p>
              迄今為止，紅杉中國有超過160家成員企業成功上市，近130家非上市公司已發展成為獨角獸。
            </p>
          </div>
        </div>
      </div>
    </section>
    <section class="section4" ref="section4">
      <div class="section4-content">
        <div class="section4-content-title">
          <h2>{{ '為什麼選擇我們' }}</h2>
          <p>專注於科技/媒體、醫療健康、消費品/服務、工業科技四個方向的投資</p>
        </div>
        <div class="section4-content-items">
          <div class="item">
            <img src="@/assets/images/1.png" alt="" />
            <h3>OKX</h3>
            <p>
              在追求全體同事物質和精神幸福的同時，推動區塊鏈和數位資產走進全球億萬用戶的生活。
            </p>
          </div>
          <div class="item">
            <img src="@/assets/images/2.png" alt="" />
            <h3>BitoEX</h3>
            <p>
              致力於推廣台灣數位貨幣而產生，為提供顧客全方位的優質服務與品牌承諾而努力。
            </p>
          </div>
          <div class="item">
            <img src="@/assets/images/3.png" alt="" />
            <h3>MaiCoin</h3>
            <p>
              MaiCoin 集團成立於 2013
              年，旨在讓數位資產成為主流，並為交易者提供安全多樣的選擇。
            </p>
          </div>
          <div class="item">
            <img src="@/assets/images/4.png" alt="" />
            <h3>MaiCoin-Max</h3>
            <p>
              MaiCoin集團為台灣交易量最大，且唯一具備區塊鏈技術公司之數位資產領導品牌，是台灣虛擬通貨產業之先鋒。
            </p>
          </div>
          <div class="item">
            <img src="@/assets/images/5.png" alt="" />
            <h3>Binance</h3>
            <p>
              時至今日，幣安已是世界頂尖的區塊鏈生態系，並擁有最大的數位資產交易所。我們的任務是在未來世界中成為加密貨幣的基礎架構供應商。
            </p>
          </div>
          <div class="item">
            <img src="@/assets/images/6.png" alt="" />
            <h3>HTX</h3>
            <p>
              HTX 成立於 2013 年，經過 11
              年的快速發展，已從一家加密貨幣交易所成長為一個全面的區塊鏈業務生態系統。
            </p>
          </div>
        </div>
      </div>
    </section>
    <footerBottom />
  </div>
</template>

<style scoped lang="sass">
.cont
  background: #fff !important
.button
  padding: 12px 30px
  margin-inline-end: 15px
  font-size: 14px
  font-weight: 500
  line-height: 1
  border-radius: 30px
  color: #fff
  background: #7354ff
  transition: all .3s ease-in-out
  &:hover
    filter: brightness(1.2)
    box-shadow: 0 0 10px rgba(0,0,0,.2)
.index-bg
  background: url('@/assets/images/breadcrumb-bg.png') no-repeat center center  / cover
  width: 100%
  display: flex
  align-items: center
  padding-top: 74px
  padding-bottom: 40pxpx
  &::before
    content: ''
    position: absolute
    top: 0
    left: 0
    width: 100%
    height: 100%
    background: rgba(0, 0, 0, 0.75)
  .index-bg-content
    display: flex
    align-items: center
    justify-content: center
    width: 1200px
    margin: 0 auto
    padding: 120px 0px
    .content
      color: #fff
      font-weight: 600
      text-align: center
      h3
        font-size: 24px
        line-height: 2
      .nav
        display: flex
        align-items: center
        font-size: 16px
        a
          color: #fff
          transition: all 0.3s
          &:hover
            color: #7354ff
        .icon
          width: 10px
          height: 10px
          margin-inline:8px
          fill: #fff
        span
          color: #7354ff
.index-main
  width: 1200px
  margin: 0 auto
  @media (max-width: 1200px)
    width: 100%

section
  position: relative
  width: 100%
.section-attain
  opacity: 1 !important
  transform: translateY(-38%)
  will-change: transform, opacity
  @media (max-width: 1200px)
    transform: translateY(-20%)
  @media (max-width: 768px)
    transform: translateY(-10%)
.section-scale
  .section2-content-left,.section2-content-right
    opacity: 1 !important
    transform: translateZ(0) scale(1) !important
    will-change: transform, opacity
  .section4-content .section4-content-title
    opacity: 1 !important
    transform: translateZ(0) scale(1) !important
    will-change: transform, opacity
.section3
  margin: 100px 0 0
  text-align: center
  .section4-content-title
    opacity: 1 !important
    transform: translateZ(0) scale(1) !important
  // h3
    // color: #7354ff
.section4-content
  width: 1200px
  margin: 0 auto 100px
  @media (max-width: 1200px)
    width: 100%
    padding: 0 20px
  .section4-content-title
    margin-bottom: 40px
    text-align: center
    opacity: 0
    transform: scale(.5)
    transition: all .6s ease-in-out
    h2
      font-size: 38px
      font-weight: 600
      line-height: 40px
      margin-bottom: 20px
    p
      font-size: 14px
      line-height: 1.5
  .section4-content-items
    margin-top: 75px
    display: grid
    grid-template-columns: repeat(3, 1fr)
    gap: 20px
    justify-content: space-between
    @media (max-width: 1200px)
      grid-template-columns: repeat(2, 1fr)
    @media (max-width: 768px)
      grid-template-columns: repeat(1, 1fr)
    .item
      position: relative
      overflow: hidden
      box-shadow: 0 15px 25px 0 rgba(0, 0, 0, 0.1)
      padding: 1.8rem 1rem
      border-radius: 20px
      transition: all .3s ease-in-out
      &:hover
        color: #fff
        // background: #7354ff
        background: linear-gradient(60deg, #7354ff 0.42%, #000b22 102.71%)
        .icon
          fill: #fff
      .icon
        margin: 0 auto
        width: 3.75rem
        height: 3.75rem
        // fill: #7354ff
      img
        width: 66px
        height: 66px
        object-fit: cover
        margin-bottom: 10px
        border-radius: 5px

      h3
        font-size: 18px
        font-weight: 600
        margin-block: 10px
</style>
